/*****************************************************************************************************************/

// @author         Michael Roberts <michael@observerly.com>
// @package        @observerly/astrometry/chamaeleon
// @license        Copyright © 2021-2024 observerly

/*****************************************************************************************************************/

import type { EquatorialCoordinate } from '../common'

import { createConstellationAsGeoJSON } from './create'

/*****************************************************************************************************************/

const centrum: EquatorialCoordinate = {
  ra: 149.074166,
  dec: -79.217778
}

/*****************************************************************************************************************/

// prettier-ignore
const aster: number[][][] = [
  // θ Chamaeleontis to α Chamaeleontis
  [
    [125.162042, -77.484583],
    [124.630292, -76.919972]
  ],
  // α Chamaeleontis to γ Chamaeleontis
  [
    [124.630292, -76.919972],
    [158.867583, -78.607806]
  ],
  // γ Chamaeleontis to δ² Chamaeleontis
  [
    [158.867583, -78.607806],
    [161.446417, -80.540194]
  ],
  // δ² Chamaeleontis to β Chamaeleontis
  [
    [161.446417, -80.540194],
    [184.587250, -79.312278]
  ],
  // γ Chamaeleontis to ε Chamaeleontis
  [
    [158.867583, -78.607806],
    [179.907042, -78.221806]
  ],
  // ε Chamaeleontis to β Chamaeleontis
  [
    [179.907042, -78.221806],
    [184.587250, -79.312278]
  ]
]

/*****************************************************************************************************************/

// prettier-ignore
const boundaries: number[][][] = [
  [
    [111.652115, -82.775886],
    [209.111109, -83.120071],
    [207.781434, -75.623596],
    [169.856973, -75.684013],
    [135.243687, -75.495468],
    [114.214704, -75.289917],
    [111.652115, -82.775886]
  ]
]

/*****************************************************************************************************************/

// https://www.iau.org/public/themes/constellations/#cha
export const chamaeleon = createConstellationAsGeoJSON(
  'Chamaeleon',
  'the lizard',
  centrum,
  aster,
  boundaries
)

/*****************************************************************************************************************/
